//На плоскости задано N отрезков координатами своих концов.
//Определить, сколько отрезков параллельны осям координат.

#include <stdio.h>

int n, parallel_count = 0;
float x1, x2, y1, y2;

int main(){

    printf("Введите кол-во отрезков: ");
    scanf("%d", &n);

    while (n < 1){

        printf("Кол-во отрезков должно быть больше 0, введите число еще раз:");
        scanf("%d", &n);

    }

    for (int i = 0; i < n; i++){

            printf("Введите координаты %d отрезка: ", i + 1);
            scanf("%f %f %f %f", &x1, &y1, &x2, &y2);

            if ((x1 == x2 || y1 == y2) && !(x1 == x2 && y1 == y2)) parallel_count++;

    }

    printf("Итого: осям координат параллельно %d отрезков\n", parallel_count);

    return 0;

}

