//Заданы своими координатами N точек на плоскости, круг радиусом R
//с центром в начале координат и вписанный в него квадрат со сторонами,
//параллельными осям координат. Определить, сколько точек находится
//одновременно и в круге, и в квадрате, а сколько вне их.

#include <stdio.h>
#include <math.h>

int main(){

    int n, count_inside = 0, count_outside = 0;
    float r, x, y, a;
    bool k1, k2;


    printf("Введите кол-во точек: ");
    scanf("%d", &n);

    while (n < 1){

        printf("Кол-во точек должно быть больше 0, введите число еще раз:");
        scanf("%d", &n);

    }

    printf("Введите радиус окружности: ");
    scanf("%f", &r);

    while (r <= 0){

        printf("Радиус должен быть больше нуля, введите значение еще раз:");
        scanf("%f", &r);

    }

    for (int i = 0; i < n; i++){

        printf("Введите координаты %d точки: ", i + 1);
        scanf("%f %f", &x, &y);

        k1 = (x * x + y * y) <= (r * r);

        a = r * sqrt(2) / 2.;

        k2 = (x <= a) && (x >= -a) && (y <= a) && (y >= -a);

        if (k2){
            count_inside++;
        }
        else if (!k1){
            count_outside++;
        }
    }

    printf("Входит %d точек\n", count_inside);
    printf("Не входит %d точек\n", count_outside);

    return 0;

}